containers/sysbench/sysbench_disk_seqwr.txt
# mpirun -x LD_LIBRARY_PATH --bind-to core -np 2 --map-by ppr:1:core --hostfile hosts.txt sysbench fileio --threads=2 --file-test-mode=seqwr run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!

Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1986.19
    fsyncs/s:                     2562.38

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               31.03

General statistics:
    total time:                          10.0683s
    total number of events:              45546

Latency (ms):
         min:                                    0.00
         avg:                                    0.44
         max:                                   17.37
         95th percentile:                        0.84
         sum:                                19975.31

Threads fairness:
    events (avg/stddev):           22773.0000/152.00
    execution time (avg/stddev):   9.9877/0.00


File operations:
    reads/s:                      0.00
    writes/s:                     2065.75
    fsyncs/s:                     2665.31

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               32.28

General statistics:
    total time:                          10.0677s
    total number of events:              47381

Latency (ms):
         min:                                    0.00
         avg:                                    0.42
         max:                                   16.24
         95th percentile:                        0.77
         sum:                                19974.24

Threads fairness:
    events (avg/stddev):           23690.5000/79.50
    execution time (avg/stddev):   9.9871/0.00